# ফাঁকা লিস্ট
এ = []

"""
a tuple is a built-in data type that allows you to create immutable sequences of values.
The values or items in a tuple can be of any type.
"""

"""
tuple এ ডাটা চেঞ্জ/কাস্টমাইজ করা যায় না, শুধু মাত্র রিড করা যায়, tuple এর ডাটা list এর থাকে অনেক দ্রুত রিড করা যায়,
tuple ইনডেক্স ফলো করে 
tuple ব্যবহার এর উদাহরণ: আমাদের জেন্ডার (পুরুষ,নারী,ট্রাঙ্গেন্ডার), আমাদের ধর্ম(হিন্দু,মুসলিম,খিস্টান), দেশের নাম(বাংলাদেশ,ভারত,চীন,রাশিয়া,নেপাল)
এই ধরনের ডাটা গুলো tuple এর মধ্যে রাখা হয় 
"""

# atuple: tuple[int, int, str, bool] = (10, 20, 'রাজ', True)
atuple = (10, 20, 'raj', True)

# tuple এ ডাটা অ্যাড করার নিয়ম:
cng = ('রনি', )                  # tuple এ ডাটা অ্যাড করতে চাই, 'রনি' এই ডাটা  অ্যাড করতে চাই, single ডাটা অ্যাড করতে চাইলে, {১ম ডাটার পরে <,> কমা দিয়ে ফাঁকা/ স্পেস দিতে হবে,}
atuple += cng                   # atuple = atuple + cng
print(atuple)

# tuple এর ডাটা ডিলিট :
ncng = list(atuple)             # tuple কে টাইপকাস্টিং করে লিস্ট এ রাখতে হবে, ncng ভেরিয়েবল এ লিস্ট টা রাখতে হবে,
ncng.pop()                      # লিস্ট এ লাস্ট আইটেম ডিলেট হবে, কারণ pop ইউজ হয়েছে।
atuple = tuple(ncng)            # ncng ভারিয়াবল কে tuple করি, তা আবার atuple ভারিয়েবল এ রাখলাম,
print(atuple)





"""
set :
set ইনডেক্স ফলো করে, tuple ও ইনডেক্স ফলো করে,
সেট এর কুনো ইনডেক্সইং নাই, সেট ইনডেক্স অনুযাই ডাটা রাখে না, আলোমেলও ডাটা রাখে,
সেট এ ডুপলিক্যাট ডাটা রাখা যায় না,

"""
aSet = {0, 1, 2, 3, 6, 5, 4, 'রাজেশ্বর', 7, 8, 9, 2, 4, 6, 8, 0}  # সেট data
print(aSet)

# set এর ডাটা ইউনিয়ন ও ইন্টারসেকশন
b = {1, 2, 3, 4, 5, 6}
c = {3, 4, 5, 6, 7, 8, 9}
print(b.intersection(c))                            # ইন্টারসেকশন
print(b & c)                                        # ইন্টারসেকশন

print(b.union(c))                                   # ইউনিয়ন
print(b | c)                                        # ইউনিয়ন

p = {True, 1, 2, 5, 4, 3, 'রাজেশ্বর', 6, 7, 8, 9, 0}    # p set
q = {False, 1, 2, 5, 4, 3, 'রাজেশ্বর', 6, 7, 8, 9, 0}   # q set
print(p)
print(q)

p.add(11)  # অ্যাড ১১ হবে , তা লাস্ট এ
print(p)

q.remove(9)  # রিমুভ ৯ হবে q সেট থাকে
print(q)





"""
dictionary:

"""
m = {
    'name': 'raj',
    'বয়স': 23
}
print(m)

# ডাটা চেঞ্জ:
m['name'] = 'rajeshwar'

# ডিকশনারি তে ডাটা অ্যাড:
m['নাম'] = 'রাজেশ্বর'                       # নাম << এখনে নেম একটা কি/key,
m['সিটি'] = 'ঠাকুরগাঁও '                     # ডিকশনারি তে সিটি কি তে, 'ঠাকুরগাঁও' ভেলু দেই,
m['সিটি'] = 'রংপুর', 'দিনাজপুর', 'পঞ্চগড়'      # ডিকশনারি এর সিটি কি এর ভেলু কে আবার আপডেট করি,
print(m)


m.popitem()                    # popitem এর মাধ্যমে লাস্ট আইটেম ডিলেট করি,
m.pop('নাম')                    # pop এর মাধ্যমে নাম ভেলু ডিলেট করি,
print(m)

print(m["বয়স"])                 # এখানে বয়স টাকে প্রিন্ট করতে চাই,
print(m.keys())                 # এখানে m ডিকশনারি এর keys গুলো প্রিন্ট করতে চাই,
print(m.values())               # এখানে m ডিকশনারি এর keys গুলো প্রিন্ট করতে চাই,




